//* SPDX-License-Identifier: AGPL-3.0-only
//* Copyright (C) 2026 Ahmad Ali Parr
//* GNU Affero General Public License version 3 only.
//ALPASM  JOB (ALP),'ASSEMBLE HARNESS',CLASS=A,MSGCLASS=X
//ASM     EXEC PGM=ASMA90,PARM='OBJECT,NODECK,XREF(SHORT)'
//SYSLIB   DD  DSN=SYS1.MACLIB,DISP=SHR
//         DD  DSN=ALP.HLASM.MACROS,DISP=SHR
//SYSIN    DD  DSN=ALP.HLASM.SRC(ALPLEX),DISP=SHR
//SYSLIN   DD  DSN=&&OBJ,DISP=(NEW,PASS),UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  UNIT=SYSDA,SPACE=(CYL,(2,2))
//LKED    EXEC PGM=IEWL,PARM='MAP,LET,LIST'
//SYSLIN   DD  DSN=&&OBJ,DISP=(OLD,DELETE)
//SYSLMOD  DD  DSN=ALP.HLASM.LOAD(ALPLEX),DISP=SHR
//SYSPRINT DD  SYSOUT=*
